{"input": "Detected emotion: sad\nUser: I studied so hard for my chemistry final, but I still failed. I feel so stupid and like I'm never going to succeed at anything.", "output": "I'm so sorry to hear that the exam didn't go the way you hoped, especially after putting in so much effort. It is completely natural to feel disappointed and disheartened when hard work doesn't immediately pay off. Please try to remember that one test score does not define your intelligence or your future worth. You are not stupid; chemistry is a challenging subject, and sometimes things just don't click on the first try. Be gentle with yourself tonight, and maybe when you're ready, you can look at what happened with fresh eyes."}
{"input": "Detected emotion: fear\nUser: I have a presentation tomorrow and I'm terrified. My hands are shaking just thinking about standing in front of everyone. What if I freeze up?", "output": "It is incredibly common to feel this kind of anxiety before a big presentation; your body is reacting to the stress, and that's okay. That fear of freezing up is scary, but often the anticipation is much worse than the actual event. Try to take a few slow, deep breaths to help steady your hands and your racing thoughts. Remember, you have prepared for this, and your classmates are likely more focused on their own turn than judging you. You can do this, one slide at a time."}
{"input": "Detected emotion: angry\nUser: My roommate ate my food again without asking! I've told them a thousand times to stop, but they just don't respect my boundaries. I'm so mad I could scream.", "output": "It makes total sense that you are furious right now; having your boundaries repeatedly crossed is incredibly frustrating. Food is personal property, and expecting your roommate to respect that is not asking too much. It sounds like you have tried to communicate this clearly, which makes their disregard even more upsetting. Maybe take a moment to cool down so you don't say something you regret, and then have a serious sit-down conversation when you are calmer. You deserve to feel respected in your own home."}
{"input": "Detected emotion: neutral\nUser: I'm just sitting here trying to decide what to do for the weekend. I don't really have any plans, but I don't feel like doing nothing either.", "output": "It sounds like you are in a bit of a limbo, looking for something to spark your interest but not feeling pulled in any specific direction. That's a pretty normal place to be on a quiet day. Maybe you could try something low-pressure, like going for a walk in a new neighborhood or visiting a local cafe you haven't tried yet. Sometimes just getting outside can help clarity what you actually feel like doing. Whatever you choose, I hope you have a relaxing weekend."}
{"input": "Detected emotion: happy\nUser: You won't believe it, but I actually got the internship! I was sure I messed up the interview, but they called me today!", "output": "That is absolutely wonderful news! Congratulations on landing the internship; you must be feeling so relieved and proud of yourself. It is funny how we can be our own worst critics, but clearly, they saw your potential and talent. Take some time to celebrate this victory, because you worked hard for it and you definitely deserve it. I'm so happy for you!"}
{"input": "Detected emotion: sad\nUser: My best friend and I got into a huge fight, and now she's not answering my texts. I feel like I've lost her forever and I don't know how to fix it.", "output": "I can hear how painful this is for you; the silence from a best friend can feel incredibly loud and isolating. It is really scary to feel like a friendship you cherish is hanging by a thread. Right now, she might just need some space to cool down and process her own feelings, just as you are processing yours. Give it a little time, and try not to panic; many strong friendships go through rough patches and come out stronger. Hang in there."}
{"input": "Detected emotion: disgust\nUser: I went to the cafeteria and saw a bug in the salad bar. It was so gross, I literally lost my appetite for the whole day.", "output": "Ugh, that sounds absolutely repulsing! I don't blame you for losing your appetite after seeing that; it is a completely natural reaction to something so unhygienic. It is really disappointing when you expect a clean meal and get a nasty surprise like that instead. Hopefully, you can find something safe and comforting to eat later when your stomach settles down. Maybe treating yourself to a meal from somewhere you trust would help wash away that memory."}
{"input": "Detected emotion: fear\nUser: I keep thinking about the future and I feel like I'm running out of time to figure out my life. Everyone else seems to have it together except me.", "output": "That feeling of falling behind is so heavy and overwhelming, but I promise you are not alone in feeling it. It is easy to look at others and assume they have it all figured out, but most people are just doing their best to navigate uncertainty too. You are on your own unique timeline, and there is no deadline for figuring out who you are or what you want to do. Try to focus on just the next right step for you, rather than the whole mountain ahead. You have plenty of time."}
{"input": "Detected emotion: surprised\nUser: My parents actually agreed to let me travel this summer! I was totally prepared for a 'no', so I'm kind of in shock.", "output": "What an amazing surprise! It is such a great feeling when things work out better than we anticipated. It sounds like you were steeling yourself for disappointment, so this shift to excitement must be quite a rush. Now you can actually start planning and dreaming about your trip, which is the fun part! Enjoy this wave of unexpected good news."}
{"input": "Detected emotion: sad\nUser: I've been feeling so lonely lately. Even when I'm around people, I feel like I'm on the outside looking in.", "output": "Loneliness is such a difficult and hollow feeling, especially when it hits you even in a crowd. It is really hard to feel disconnected, like there is a glass wall between you and everyone else. Please know that this feeling doesn't mean there is something wrong with you; it just means you are craving deeper connection right now. Maybe try to share a small piece of how you are feeling with someone you trust, or focus on one-on-one interactions which can sometimes feel less isolating. You matter, and you deserve to feel seen."}
{"input": "Detected emotion: angry\nUser: I got a parking ticket today for parking in a spot that wasn't even clearly marked! It's so unfair, I can't afford this right now.", "output": "That is incredibly frustrating! It feels so unjust to be penalized for something that wasn't your fault, especially when money is tight. Dealing with unexpected expenses like that can really throw off your whole week and make your blood boil. It might be worth taking photos of the unclear signage and trying to contest the ticket if you have the energy. For now, just let yourself be mad about it; it is a totally valid reaction to an unfair situation."}
{"input": "Detected emotion: sad\nUser: I just don't like the way I look. I see all these perfect people on Instagram and I just feel ugly and inadequate.", "output": "It is heartbreaking to hear you talk about yourself that way, but I understand how easy it is to fall into that comparison trap. Social media is a highlight reel, often heavily edited, and it is not a fair standard to measure your real, human beauty against. You are worthy and valuable exactly as you are, regardless of how you think you compare to an image on a screen. Maybe taking a little break from those apps could give your mind some space to be kinder to yourself. You deserve to feel comfortable in your own skin."}
{"input": "Detected emotion: fear\nUser: My dad has been sick lately and the doctors want to run more tests. I'm so scared it's something serious.", "output": "I am so sorry you are going through this; waiting for medical news is one of the most anxiety-inducing things we can experience. It is completely understandable that your mind is racing to the worst-case scenarios because you care about him so much. Try to take it one day at a time, and lean on your family or friends for support while you wait. No matter what the results are, you will handle it better if you aren't exhausting yourself with worry right now. Sending you strength."}
{"input": "Detected emotion: neutral\nUser: I finished all my classes for the day. Just walking back to the dorm now.", "output": "That sounds like a nice, quiet moment to decompress after a day of learning. The walk back can be a good time to just clear your head and let go of academic thoughts for a bit. I hope you have a relaxing evening ahead of you, maybe with some good food or a show you like. Enjoy the downtime."}
{"input": "Detected emotion: happy\nUser: I baked cookies for my study group and everyone loved them! It made me feel really good to see them happy.", "output": "That is such a sweet thing to do! There is something really special about sharing food you made and seeing people enjoy it. It sounds like you brought a lot of warmth and joy to your study group today. Hold onto that good feeling; it is a reminder of how your small acts of kindness can brighten people's days. I bet they tasted amazing!"}
{"input": "Detected emotion: sad\nUser: I miss my home. Being at college is great, but sometimes I just want my own bed and my mom's cooking.", "output": "Homesickness is such a real and heavy ache; it is completely normal to miss the comfort and familiarity of home. Even when you are happy where you are, there is no replacement for your own bed and a meal made with love. It is okay to let yourself feel a bit sad about it today. Maybe you could give your mom a call or try to recreate a comfort meal to bring a little piece of home to you. This feeling usually comes in waves, and it will pass."}
{"input": "Detected emotion: disgust\nUser: I was working on a group project and one guy was just so rude and condescending to everyone. It was honestly gross behavior.", "output": "It is really unpleasant to be around that kind of arrogance, especially when you are trying to work as a team. Disrespectful behavior like that leaves a bad taste in everyone's mouth and makes the work so much harder than it needs to be. It is good that you can recognize it for what it is—his problem, not yours. Try to maintain your professionalism and focus on the other group members who are respectful. You shouldn't have to deal with that, but you are handling it well."}
{"input": "Detected emotion: fear\nUser: I think I might fail this semester. I'm so far behind and I don't know how to catch up. I feel paralyzed.", "output": "That paralysis is a very common reaction to feeling overwhelmed; it's your brain's way of trying to protect you from stress. It feels like a mountain, but you don't have to climb it all at once. Maybe try to identify just one small, manageable assignment you can tackle today to break the ice. If it feels too much, please consider reaching out to your academic advisor or a professor; they are there to help you make a plan, not to judge you. You still have options."}
{"input": "Detected emotion: surprised\nUser: I ran into my ex today at the coffee shop. I thought I'd be a mess, but I actually felt... okay.", "output": "That is a really significant realization! It is often surprising when we brace ourselves for pain and find strength instead. It sounds like you have done a lot of healing and processing since the breakup. Feeling 'okay' is a huge victory and a sign that you are moving forward. Be proud of yourself for handling that situation with such grace."}
{"input": "Detected emotion: sad\nUser: I feel so drained. I keep trying to help everyone else with their problems, but nobody asks how I'm doing.", "output": "It is incredibly exhausting to be the strong one all the time, and it hurts when that care isn't reciprocated. You are pouring from an empty cup, and it makes total sense that you feel drained and a bit forgotten. Your needs and feelings are just as important as anyone else's. It might be time to set some gentle boundaries and take a step back to care for yourself for a while. You deserve to be supported too."}
{"input": "Detected emotion: angry\nUser: The internet cut out right in the middle of my online exam! I'm panic-emailing the professor but I'm so angry at this stupid wifi.", "output": "Oh no, that is a nightmare scenario! It is completely valid to be furious at technology failing you at the worst possible moment. That sudden spike of stress and anger is a natural physical response to the situation. Keep documenting everything and send those emails; most professors understand that technical issues happen. Take a deep breath to steady your hands while you type. You are doing everything you can right now."}
{"input": "Detected emotion: fear\nUser: I have to make a phone call to schedule a doctor's appointment and I've been putting it off for weeks. I hate talking on the phone.", "output": "Phone anxiety is very real and can make a simple task feel like a huge hurdle. It is understandable that you've been avoiding it, but the anticipation is likely making it feel scarier than it will actually be. Maybe it would help to write down exactly what you want to say beforehand so you have a script to follow. You can do this; it will only take a few minutes, and then the weight will be off your shoulders. Just dial the number and take it one step at a time."}
{"input": "Detected emotion: happy\nUser: I just finished reading a really good book. It was the best story I've read in years!", "output": "There is nothing quite like the feeling of finishing an amazing book! It sounds like you were totally immersed in that world. That 'book hangover' where you are still thinking about the characters is bittersweet but wonderful. I'm glad you found a story that resonated with you so much. Do you think you'll look for other books by the same author?"}
{"input": "Detected emotion: neutral\nUser: I'm just organizing my desk. It got kind of messy over the week.", "output": "That sounds like a productive and satisfying way to reset for the week ahead. There is something really calming about creating order out of a messy space. Having a clean desk can really help clear your mind too. I hope the process feels therapeutic and you enjoy your tidy space when you're done."}
{"input": "Detected emotion: sad\nUser: I feel like I'm drifting apart from my high school friends. We just don't have anything in common anymore.", "output": "Growing apart is a very natural part of life, but that doesn't make it any less painful. It is sad to feel that distance growing with people who used to know you so well. It doesn't mean the friendship wasn't real or important; it just means you are all evolving in different directions. It is okay to grieve that loss while also making space for new connections that fit who you are now. Those memories will always be yours."}
{"input": "Detected emotion: disgust\nUser: I saw someone throw their trash on the ground right next to an empty bin. People are so lazy sometimes.", "output": "That is really frustrating to witness! It is hard not to feel disgusted when people show such a blatant lack of respect for the environment and their community. It takes zero effort to use a bin that is right there. It is good that you care about keeping things clean, even if others are careless. Don't let their laziness ruin your mood, but your annoyance is totally justified."}
{"input": "Detected emotion: fear\nUser: I'm worried I chose the wrong major. What if I graduate and hate my job?", "output": "That is a very heavy question that many students wrestle with. It is scary to feel like you are locking yourself into a path that might not make you happy. Please remember that your major does not dictate your entire life; many people have careers that have nothing to do with what they studied. You are building transferable skills no matter what. If you are really unsure, maybe talking to a career counselor could help clarify your options. You are not trapped."}
{"input": "Detected emotion: happy\nUser: My plant finally bloomed! I've been watering it for months and I thought it was dead.", "output": "Yay! That is such a rewarding moment of success! It just goes to show that patience and consistent care really do pay off. It must be so nice to see that pop of color after waiting so long. You are clearly doing a great job as a plant parent. Enjoy your beautiful new bloom!"}
{"input": "Detected emotion: sad\nUser: I'm just feeling really down today. No specific reason, just heavy.", "output": "Thank you for sharing that with me. Sometimes the heaviness comes without a clear reason, and that can be confusing and exhausting. You don't need a specific 'reason' to feel sad; your feelings are valid just as they are. Be gentle with yourself today—maybe wear your most comfortable clothes, drink some water, and just let yourself be. This cloud will eventually pass, but for now, I'm here with you."}
{"input": "Detected emotion: fear\nUser: I think someone is following me. I'm walking home alone and I'm scared.", "output": "That is a very scary situation and your safety is the most important thing right now. Please trust your instincts. If you can, head immediately towards a well-lit, public area or a shop that is open. Call a friend or family member so someone knows exactly where you are and can stay on the line with you. If you feel you are in immediate danger, please do not hesitate to call emergency services. Stay alert and get to safety."}
